particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    return NULL;
}

static void dispatchBleEvent(hal_ble_event_t* evt) {
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleEvtCallbacks[i] != NULL) {
            s_bleEvtCallbacks[i](evt);
        }
    }
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t ret;

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "Advertising stopped.");
            s_isAdvertising = false;
        } break;

        case BLE_GAP_EVT_CONNECTED: {
            LOG_DEBUG(TRACE, "BLE connected, handle: 0x%04X", event->evt.gap_evt.conn_handle);

            s_bleConnInfo.role             = event->evt.gap_evt.params.connected.role;
            s_bleConnInfo.conn_handle      = event->evt.gap_evt.conn_handle;
            s_bleConnInfo.conn_interval    = event->evt.gap_evt.params.connected.conn_params.max_conn_interval;
            s_bleConnInfo.slave_latency    = event->evt.gap_evt.params.connected.conn_params.slave_latency;
            s_bleConnInfo.conn_sup_timeout = event->evt.gap_evt.params.connected.conn_params.conn_sup_timeout;

            // Update connection parameters if needed.
            s_connParamsUpdateAttempts = 0;
            updateConnParamsIfNeeded();

            hal_ble_event_t bleEvt;
            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleConnInfo.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_CONNECTED;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GAP_EVT_DISCONNECTED: {
            LOG_DEBUG(TRACE, "BLE Disconnected, handle: 0x%04X, reason: %d",
                      event->evt.gap_evt.conn_handle,
                      event->evt.gap_evt.params.disconnected.reason);

            s_bleConnInfo.conn_handle = BLE_INVALID_CONN_HANDLE;

            // Stop the connection parameters update timer.
            if (!os_timer_is_active(s_connParamsUpdateTimer, NULL)) {
                os_timer_change(s_connParamsUpdateTimer, OS_TIMER_CHANGE_STOP, true, 0, 0, NULL);
            }

            hal_ble_event_t bleEvt;
            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleConnInfo.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_DISCONNECTED;
            bleEvt.conn_event.reason      = event->evt.gap_evt.params.disconnected.reason;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            s_bleConnInfo.conn_interval    = event->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
            s_bleConnInfo.slave_latency    = event->evt.gap_evt.params.conn_param_update.conn_params.slave_latency;
            s_bleConnInfo.conn_sup_timeout = event->evt.gap_evt.params.conn_param_update.conn_params.conn_sup_timeout;

            // Update connection parameters if needed.
            updateConnParamsIfNeeded();
        } break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "PHY update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "GAP data length updated.");
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "GAP data length update request.");

            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret_code_t ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, NULL);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            // Pairing is not supported
            ret_code_t ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_AUTH_STATUS: {
            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            }
            else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT: {
            LOG_DEBUG(ERROR, "BLE GAP timeout, source: %d", event->evt.gap_evt.params.timeout.src);
        } break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "ATT_MTU exchanged.");
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            // Disconnect on GATT Client timeout event.
            LOG_DEBUG(ERROR, "BLE GATT Client Timeout, connection handle: 0x%04X.", event->evt.gattc_evt.conn_handle);
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "GATT ATT MTU exchange request.");

            ret_code_t ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_WRITE: {
            hal_ble_char_t* bleChar;
            uint16_t attrHandle = event->evt.gatts_evt.params.write.handle;
            bleChar = findCharacteristic(attrHandle);
            if (bleChar != NULL) {
                if (attrHandle == bleChar->cccd_handle) {
                    LOG_DEBUG(TRACE, "Write CCCD.");
                }
                else if (attrHandle == bleChar->value_handle) {
                    LOG_DEBUG(TRACE, "Write value.");

                    memcpy(bleChar->value, event->evt.gatts_evt.params.write.data, event->evt.gatts_evt.params.write.len);

                    hal_ble_event_t bleEvt;
                    bleEvt.evt_type               = BLE_EVT_TYPE_DATA;
                    bleEvt.data_event.conn_handle = event->evt.gatts_evt.conn_handle;
                    bleEvt.data_event.char_handle = bleChar->value_handle;
                    bleEvt.data_event.data        = bleChar->value;
                    bleEvt.data_event.data_len    = bleChar->value_len;
                    if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }
            }
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {

