particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    ret = sd_ble_gatts_service_add(type, &svcUuid, &service->start_handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    service->type = type;
    memcpy(&service->uuid, uuid, sizeof(hal_ble_uuid_t));

    s_bleService[s_bleServiceCount] = service;
    s_bleServiceCount++;

    return SYSTEM_ERROR_NONE;
}

int ble_add_characteristic(hal_ble_char_init_t* char_init, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    ret_code_t               ret;
    ble_uuid_t               charUuid;
    ble_gatts_char_md_t      char_md;
    ble_gatts_attr_md_t      value_attr_md;
    ble_gatts_attr_md_t      user_desc_attr_md;
    ble_gatts_attr_md_t      cccd_attr_md;
    ble_gatts_attr_t         char_value_attr;
    ble_gatts_char_handles_t char_handles;

    if (char_init == NULL || char_init->service == NULL || char_init->value == NULL || \
        ble_char == NULL || char_init->value_len > BLE_MAX_CHAR_VALUE_LEN) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (char_init->service->char_count >= BLE_MAX_CHARS_PER_SERVICE_COUNT) {
        return SYSTEM_ERROR_LIMIT_EXCEEDED;
    }

    int err = addUuidIfNeeded(&char_init->uuid, &charUuid);
    if (err != SYSTEM_ERROR_NONE) {
        return err;
    }

    /* Characteristic metadata */
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.broadcast      = (char_init->properties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
    char_md.char_props.read           = (char_init->properties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
    char_md.char_props.write_wo_resp  = (char_init->properties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
    char_md.char_props.write          = (char_init->properties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
    char_md.char_props.notify         = (char_init->properties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
    char_md.char_props.indicate       = (char_init->properties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
    char_md.char_props.auth_signed_wr = (char_init->properties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;

    // User Description Descriptor
    if (char_init->desc != NULL) {
        memset(&user_desc_attr_md, 0, sizeof(user_desc_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&user_desc_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&user_desc_attr_md.write_perm);
        value_attr_md.vloc    = BLE_GATTS_VLOC_STACK;

        char_md.p_char_user_desc        = char_init->desc;
        char_md.char_user_desc_max_size = char_init->desc_len;
        char_md.char_user_desc_size     = char_init->desc_len;
        char_md.p_user_desc_md          = &user_desc_attr_md;
    }
    else {
        char_md.p_char_user_desc = NULL;
        char_md.p_user_desc_md   = NULL;
    }

    // Client Characteristic Configuration Descriptor
    if (char_md.char_props.notify || char_md.char_props.indicate) {
        memset(&cccd_attr_md, 0, sizeof(cccd_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.write_perm);
        cccd_attr_md.vloc = BLE_GATTS_VLOC_STACK;

        char_md.p_cccd_md = &cccd_attr_md;
    }
    // TODO:
    char_md.p_char_pf = NULL;
    char_md.p_sccd_md = NULL;

    /* Characteristic value attribute metadata */
    memset(&value_attr_md, 0, sizeof(value_attr_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.write_perm);
    value_attr_md.vloc    = BLE_GATTS_VLOC_USER;
    value_attr_md.rd_auth = 0;
    value_attr_md.wr_auth = 0;
    value_attr_md.vlen    = 1;

    /* Characteristic value attribute */
    memset(&char_value_attr, 0, sizeof(char_value_attr));
    char_value_attr.p_uuid    = &charUuid;
    char_value_attr.p_attr_md = &value_attr_md;
    char_value_attr.init_len  = char_init->value_len;
    char_value_attr.init_offs = 0;
    char_value_attr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    char_value_attr.p_value   = char_init->value;

    ret = sd_ble_gatts_characteristic_add(char_init->service->start_handle, &char_md, &char_value_attr, &char_handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    ble_char->service_handle   = char_init->service->start_handle;
    ble_char->uuid             = char_init->uuid;
    ble_char->properties       = char_init->properties;
    ble_char->value_handle     = char_handles.value_handle;
    ble_char->user_desc_handle = char_handles.user_desc_handle;
    ble_char->cccd_handle      = char_handles.cccd_handle;
    ble_char->sccd_handle      = char_handles.sccd_handle;

    memcpy(ble_char->value, char_init->value, char_init->value_len);
    ble_char->value_len        = char_init->value_len;

    char_init->service->chars[char_init->service->char_count] = ble_char;
    char_init->service->char_count++;

    return SYSTEM_ERROR_NONE;
}

int ble_publish(uint16_t conn_handle, hal_ble_char_t* ble_char, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    if (ble_char == NULL || data == NULL || conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (!(ble_char->properties & BLE_SIG_CHAR_PROP_NOTIFY) && !(ble_char->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    // Check if the client has enabled notification or indication
    uint8_t cccd[2];
    ble_gatts_value_t gattValue;
    gattValue.p_value = cccd;
    gattValue.len = sizeof(cccd);
    gattValue.offset = 0;
    ret_code_t ret = sd_ble_gatts_value_get(conn_handle, ble_char->cccd_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    uint16_t cccd_value = uint16_decode(cccd);
    if (cccd_value == BLE_SIG_CCCD_VAL_DISABLED || cccd_value > BLE_SIG_CCCD_VAL_INDICATION || s_indInProgress) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    else {
        ble_gatts_hvx_params_t hvxParams;

        if (cccd_value == BLE_SIG_CCCD_VAL_NOTIFICATION) {
            hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
        }
        else {
            // Only one indication procedure can be ongoing per connection at a time.
            hvxParams.type = BLE_GATT_HVX_INDICATION;
        }

        uint16_t hvxLen = len;
        hvxParams.handle = ble_char->value_handle;
        hvxParams.offset = 0;
        hvxParams.p_data = data;
        hvxParams.p_len  = &hvxLen;

        ret_code_t ret = sd_ble_gatts_hvx(conn_handle, &hvxParams);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

